name: "ensemble_segmentation"
platform: "ensemble"
max_batch_size: 256
input [
  {
    name: "INPUT"
    data_type: TYPE_UINT8
    dims: [196608]
  }
]

output: [
  {
    name: "OUTPUT",
    data_type: TYPE_INT32,
    dims: [256, 256, 1]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "preprocess_segmentation"
      model_version: -1
      input_map {
        key: "INPUT_0"
        value: "INPUT"
      }
      output_map {
        key: "OUTPUT_0"
        value: "preprocessed_image"
      }
    },
    {
      model_name: "clothes_segmentation"
      model_version: -1
      input_map {
        key: "intput"
        value: "preprocessed_image"
      }
      output_map {
        key: "output"
        value: "OUTPUT"
      }
    }
  ]
}
response_cache {
enable: False
}