
name: "preprocess_segmentation"
backend: "python"
max_batch_size: 256
input [
{
    name: "INPUT_0"
    data_type: TYPE_UINT8
    dims: [196608]
}
]

output [
{
    name: "OUTPUT_0"
    data_type: TYPE_FP32
    dims: [ 3, 256, 256]
}
]

instance_group [{ kind: KIND_CPU }]