name: "postprocess_yolov5_crowd"
backend: "python"
max_batch_size: 256 
input [
{
    name: "INPUT_0"
    data_type: TYPE_FP32
    dims: [15120, 7]
}
]

output [
{
    name: "OUTPUT_0"
    data_type: TYPE_FP32
    dims: [1, -1, 6]
}
]

instance_group [ 
    { 
        count: 1
        kind: KIND_CPU
    }
]